<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #E8DB7D;
}
-->
</style>
<link href="../CSS_Cuerpo.css" rel="stylesheet" type="text/css" />
</head>

<body>
<div align="center">
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold">&iquest;Que son las Computadoras? </div></td>
    </tr>
    <tr>
      <td width="485" height="300"><p align="justify">La computadora es un dispositivo electr&oacute;nico capaz de  recibir, procesar y almacenar datos para realizar diversas tareas. Est&aacute;  compuesta por hardware, que incluye componentes f&iacute;sicos como la CPU, la memoria  y los dispositivos de entrada y salida, y software, que son los programas y  aplicaciones que permiten su funcionamiento. Desde su invenci&oacute;n, las  computadoras han evolucionado significativamente en t&eacute;rminos de potencia y  capacidad, y se utilizan en una amplia variedad de campos, como la educaci&oacute;n,  la medicina, la ingenier&iacute;a y el entretenimiento.</p>
        <p align="justify">El funcionamiento de una computadora se basa en la  ejecuci&oacute;n de instrucciones l&oacute;gicas y aritm&eacute;ticas, el almacenamiento de datos en  memoria y la comunicaci&oacute;n con dispositivos externos. A lo largo de la historia,  las computadoras han pasado por varias generaciones, cada una con avances  tecnol&oacute;gicos que han permitido mejorar su rendimiento y capacidades.  Actualmente, las computadoras son fundamentales en la sociedad moderna,  facilitando tareas cotidianas, optimizando procesos industriales y permitiendo  el desarrollo de nuevas tecnolog&iacute;as.</p>
      </td>
      <td width="315">&nbsp; </td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td height="49"><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify" class="bold">Indice</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td height="150" align="left" valign="top"><p><a href="#Componentes">1. Componentes de un computador. </a></p>
        <p><a href="#Funcionamiento">2. El Funcionamiento de un Computador. </a></p>
        <p><a href="#caracteristicas">3. Caracteristicas de un Computador. </a></p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold"><a name="Componentes" id="Componentes"></a>Componentes de un computador. </div></td>
    </tr>
    <tr>
      <td width="485" height="360"><p align="justify">Los componentes principales de una computadora son la placa  madre, el procesador, la memoria RAM, el almacenamiento, la tarjeta de  gr&aacute;ficos, la fuente de alimentaci&oacute;n, el sistema de refrigeraci&oacute;n y el gabinete.  La placa madre, tambi&eacute;n conocida como motherboard, es el componente principal  de cualquier sistema inform&aacute;tico, al que todos los dem&aacute;s dispositivos se  conectan directa o indirectamente. Cuenta con un software b&aacute;sico llamado BIOS  que le permite realizar y sincronizar sus funciones, la administraci&oacute;n de la  energ&iacute;a el&eacute;ctrica y el reconocimiento de la conexi&oacute;n.</p>
        <p align="justify"><br />
          El procesador, o CPU, es el cerebro de la computadora,  encargado de ejecutar las operaciones matem&aacute;ticas. La memoria RAM es donde se  almacenan los datos temporales que la computadora necesita para realizar  tareas. El almacenamiento, por su parte, es donde se guardan los datos de forma  permanente, como archivos y programas. La tarjeta de gr&aacute;ficos se encarga de  procesar y generar las im&aacute;genes que se muestran en el monitor. La fuente de  alimentaci&oacute;n suministra la energ&iacute;a necesaria para el funcionamiento de todos  los componentes. El sistema de refrigeraci&oacute;n se encarga de disipar el calor  generado por los componentes para evitar el sobrecalentamiento. Finalmente, el  gabinete es la estructura que alberga y protege a todos los componentes  internos de la computadora.</p></td>
      <td width="315">&nbsp;</td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p>
      </td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="3"><div align="center" class="bold"><a name="Funcionamiento" id="Funcionamiento"></a>El Funcionamiento de un computador. </div></td>
    </tr>
    <tr>
      <td width="196" height="71"><p>&nbsp;</p>        
        <p>&nbsp;</p>      </td>
      <td width="604" colspan="2"><p align="justify">El funcionamiento de una computadora se basa en la ejecuci&oacute;n  de diversas funciones. En primer lugar, la computadora es capaz de recibir un  conjunto de &oacute;rdenes y ejecutarlas, realizando c&aacute;lculos complejos, agrupando y  correlacionando informaci&oacute;n, y procesando grandes cantidades de datos. Esta  capacidad se logra a trav&eacute;s de su hardware, que incluye la CPU, la memoria, el  disco duro y otros componentes f&iacute;sicos, y su software, que son los programas y  aplicaciones que permiten su funcionamiento. La interacci&oacute;n entre el hardware y  el software es fundamental para el funcionamiento de la computadora, ya que el  hardware ejecuta las instrucciones del software para realizar tareas  espec&iacute;ficas.</p>
        <p align="justify"><br />
          Adem&aacute;s, el funcionamiento de una computadora se basa en la  ejecuci&oacute;n de cuatro funciones b&aacute;sicas: recibir, proporcionar, procesar y  almacenar datos. La computadora recibe datos e instrucciones a trav&eacute;s de  dispositivos de entrada, como el teclado y el mouse, los procesa realizando  operaciones aritm&eacute;ticas y l&oacute;gicas, y almacena la informaci&oacute;n en la memoria RAM  y el disco duro para su posterior recuperaci&oacute;n. Estas funciones permiten a la  computadora realizar una amplia variedad de tareas, desde el procesamiento  matem&aacute;tico y la reproducci&oacute;n de contenidos multimedia, hasta la programaci&oacute;n  digital y la fabricaci&oacute;n de nuevo software.</p>
      </td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold"><a name="caracteristicas" id="caracteristicas"></a>Caracteristicas de un Computador. </div></td>
    </tr>
    <tr>
      <td width="196" height="71" rowspan="2"><p>&nbsp;</p>
          <p>&nbsp;</p></td>
      <td><p align="justify">Las  computadoras son dispositivos electr&oacute;nicos que se utilizan en una amplia  variedad de campos, desde las computadoras personales hasta relojes,  autom&oacute;viles, electrodom&eacute;sticos y televisores. Estas m&aacute;quinas son capaces de  realizar m&uacute;ltiples actividades y se componen de partes f&iacute;sicas y partes  intangibles. Sus caracter&iacute;sticas principales incluyen:</p>      </td>
    </tr>
    <tr>
      <td height="147"><ol>
        <ol>
          <li>
            <p>Hardware y software: Las computadoras  consisten en hardware, que abarca los aspectos f&iacute;sicos y tangibles del sistema,  como la placa base, el procesador, la memoria RAM y el disco duro, y software,  que abarca los aspectos intangibles y virtuales del sistema, como las  aplicaciones, los comandos y el sistema operativo. </p>
          </li>
          <li>
            <p>Funciones b&aacute;sicas: Las funciones  fundamentales de una computadora incluyen almacenar datos y permitir su f&aacute;cil  recuperaci&oacute;n, procesar grandes cantidades de informaci&oacute;n, organizar la  informaci&oacute;n y facilitar su acceso, y ejecutar comandos para realizar diversas  tareas, desde el procesamiento matem&aacute;tico hasta la reproducci&oacute;n de contenidos  multimedia. </p>
          </li>
          <li>
            <p>Componentes f&iacute;sicos: Entre las  caracter&iacute;sticas f&iacute;sicas de una computadora se encuentran la placa base, el  procesador, la memoria RAM, el disco duro, la tarjeta gr&aacute;fica, el  almacenamiento interno y otros accesorios como teclado, mouse, monitor, entre  otros.</p>
          </li>
      </ol>        <p>&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
</div>
</body>
</html>
