<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	background-color: #E8DB7D;
}
-->
</style>
<link href="../CSS_Cuerpo.css" rel="stylesheet" type="text/css" />
</head>

<body>
<div align="center">
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold">&iquest;Que son los Sistemas Operativos? </div></td>
    </tr>
    <tr>
      <td width="485" height="300"><p align="justify">El sistema operativo es el&nbsp;software&nbsp;que&nbsp;coordina y dirige todos los servicios y&nbsp;aplicaciones&nbsp;que utiliza el&nbsp;usuario&nbsp;en una&nbsp;computadora, por eso es el m&aacute;s importante y fundamental. Se trata de&nbsp;programas&nbsp;que permiten y regulan los aspectos m&aacute;s b&aacute;sicos del sistema. Los sistemas operativos m&aacute;s utilizados son&nbsp;Windows, Linux, OS/2 y DOS.</p>
        <p align="justify">Los sistemas operativos, tambi&eacute;n llamados&nbsp;n&uacute;cleos&nbsp;o&nbsp;kernels, suelen ejecutarse de manera privilegiada respecto al resto del&nbsp;software,&nbsp;sin permitir que un programa cualquiera realice cambios de importancia sobre &eacute;l&nbsp;que puedan comprometer su funcionamiento.</p>
        <p align="justify">El sistema operativo es el&nbsp;protocolo&nbsp;b&aacute;sico de operatividad del&nbsp;computador, que coordina todas sus dem&aacute;s funciones de&nbsp;comunicaciones, de procesamiento, de interfaz con el usuario.</p>
      </td>
      <td width="315">&nbsp; </td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">Los sistemas operativos consisten en&nbsp;interfaces gr&aacute;ficas, entornos de escritorio o gestores de ventanas&nbsp;que brindan al usuario una representaci&oacute;n gr&aacute;fica de los procesos en marcha. Tambi&eacute;n puede ser una l&iacute;nea de comandos, es decir, un conjunto de instrucciones ordenado seg&uacute;n su prioridad y que funciona en base a &oacute;rdenes introducidas por el usuario.</p>
        <p align="justify">Las primeras versiones de las computadoras no ten&iacute;an sistemas operativos. En la d&eacute;cada de los sesenta los ordenadores usaban procesamientos por lotes y fue durante estos a&ntilde;os cuando comenzaron a desarrollarse los sistemas operativos.</p>
      <p align="justify">Si bien a partir de los ochenta ya hab&iacute;an comenzado a surgir algunos muy conocidos, a partir de los noventa estos programas comenzaron a ser m&aacute;s flexibles y fuertes.&nbsp;Uno de los grandes hitos fue el lanzamiento de Windows 95.</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify" class="bold">Indice</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td width="619" height="303" align="left" valign="top"><p><a href="Que_es.html#Para_que">2. &iquest;Para que sirve un Sistema Operativo?</a><br />
          <a href="#Componentes">3. Componentes de un Sistema Operativo</a><br />
          <a href="#Gestion_proc">--3.1 Gestion de Procesos </a><br />
          <a href="#Gestion_mem">--3.2 Gesti&oacute;n de la memoria principal</a><br />
          <a href="#Gestion_alm">--3.3 Gesti&oacute;n del almacenamiento secundario</a><br />
          <a href="#Sist_entr_sl">--3.4 Sistema de entrada/salida</a><br />
          <a href="#Sist_arch">--3.5 Sistema de archivos</a><br />
          <a href="#Sist_prot">--3.6 Sistemas de protecci&oacute;n</a><br />
          <a href="#Sist_comun">--3.7 Sistema de comunicaciones</a><br />
          <a href="#Prg_sist">--3.8 Programas del sistema</a><br />
          <a href="#Gest_recur">--3.9 Gesti&oacute;n de recursos</a><br />
          <a href="#caracteristicas">4. Caracteristicas de un Sistema Operativo</a><br />
          <a href="#Sist_basicos">5. Sistemas operativos b&aacute;sicos: los m&aacute;s comunes y utilizados</a><br />
          <a href="#Tipos">6. Tipos de sistemas operativos</a><br />
          <a href="#lotes">--5.1 Sistema operativopor lotes</a><br />
          <a href="#multitarea">--5.2 Sistemas operativos multitarea o de tiempo compartido</a><br />
          <a href="#real">--5.3 Sistemas operativos en tiempo real</a><br />
          <a href="#distribuidos">--5.4 Sistemas distribuidos</a><br />
          <a href="#Prg_sist">--5.5 Sistemas operativos de red</a><br />
          <a href="#moviles">--5.6 Sistemas operativos m&oacute;viles </a></p>
      </td>
      <td width="152">&nbsp;</td>
      <td width="29">&nbsp;</td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold"><a name="Para_que" id="Para_que"></a>&iquest;Para que sirve un Sistema Operativo? </div></td>
    </tr>
    <tr>
      <td width="485" height="360"><p align="justify">Su funci&oacute;n principal es la de darnos las herramientas necesarias para poder controlar nuestra computadora y poder hacer uso de ella, de la forma m&aacute;s c&oacute;moda y sencilla posible.</p>
        <p align="justify">Las funciones b&aacute;sicas del Sistema Operativo son administrar los recursos del ordenador, coordinar el hardware y organizar archivos y directorios en los dispositivos de almacenamiento de nuestro ordenador. Estos permiten que&nbsp;otros programas puedan utilizarlos de apoyo para poder funcionar.&nbsp;Por eso, a partir del sistema utilizado pueden ser instalados ciertos programas y otros no.</p>
        <p align="justify">Son parte esencial del funcionamiento de los sistemas inform&aacute;ticos y&nbsp;la pieza de software central en la cadena de procesos, ya que establecen las condiciones m&iacute;nimas para que todo funcione: la administraci&oacute;n de los recursos, el&nbsp;m&eacute;todo&nbsp;de&nbsp;comunicaci&oacute;n&nbsp;con el usuario y con otros sistemas, las aplicaciones adicionales. Como forma de accesibilidad para la mayoria de los usuarios estos utilizan im&aacute;genes y botones para poder comunicarnos con el ordenador de forma sencilla y f&aacute;cil para decirle lo que queremos hacer en cada momento a nuestro ordenador.</p>
      </td>
      <td width="315">&nbsp;</td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p>
      </td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="3"><div align="center" class="bold"><a name="Componentes" id="Componentes"></a>Componentes de un Sistema Operativo </div></td>
    </tr>
    <tr>
      <td width="196" height="71" rowspan="2"><p>&nbsp;</p>        
        <p>&nbsp;</p>      </td>
      <td colspan="2"><p align="justify">Los diferentes elementos del sistema operativo est&aacute;n estrechamente relacionados. Las partes de un sistema operativo comprende un conjunto de acciones que se llevan a cabo en una computadora. Los&nbsp;componentes del sistema operativo&nbsp;de los que estaremos hablando son:</p>      </td>
    </tr>
    <tr>
      <td width="301" height="130"><div align="justify">
        <ul>
          <li class="p">Los procesos</li>
          <li class="p">La memoria principal</li>
          <li class="p">El almacenamiento secundario</li>
          <li class="p">El sistema de entrada/salida</li>
          <li class="p">El sistema de archivos</li>
        </ul>
      </div></td>
      <td width="303"><div align="justify">
        <ul>
          <li class="p">Los sistemas de protecci&oacute;n</li>
          <li class="p">El sistema de comunicaciones</li>
          <li class="p">Los programas del sistema</li>
          <li class="p">El gestor de recursos</li>
        </ul>
      </div></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td width="369"><h3 align="justify"><a name="Gestion_proc" id="Gestion_proc"></a>Gesti&oacute;n de procesos</h3>
        <p align="justify">Entre&nbsp;los componentes de un sistema operativo&nbsp;est&aacute;n los procesos. Cuando se habla de un proceso se hace referencia a un&nbsp;programa en ejecuci&oacute;n. Un proceso es un conjunto de instrucciones que corresponden a un programa y que son ejecutadas por la CPU. En un programa se pueden ejecutar uno o varios procesos diferentes. La ejecuci&oacute;n de un programa necesita recursos del sistema como tiempo de CPU, memoria, archivos y dispositivos de E/S.</p>
        <p align="justify">Un proceso puede pasar por los estados nuevo, preparado, ejecuci&oacute;n, bloqueado y terminado cuando su ciclo de vida es de 5 estados. Si el proceso solo se ejecuta y termina el ciclo de vida es de 2 estados. Los procesos para su ejecuci&oacute;n se planifican siguiendo algoritmos. Dos de los algoritmos de planificaci&oacute;n m&aacute;s comunes son el algoritmo Round Robin y el algoritmo FIFO.</p>
        <p align="justify">El sistema operativo es el responsable de asignar recursos a los procesos, crear y destruir procesos, parar y reanudar procesos y proporcionar que los procesos se comuniquen y sincronicen.</p>      </td>
      <td width="431"><div align="center"><img src="../../Media/Imagenes/diagramaestadosprocesos.png" width="354" height="213" /></div></td>
    </tr>
    <tr>
      <td><h3 align="justify">&nbsp;</h3>      </td>
      <td><h3 align="justify"><a name="Gestion_mem" id="Gestion_mem"></a>Gesti&oacute;n de la memoria principal</h3>
        <p align="justify">Otro de&nbsp;los componentes del sistema operativo&nbsp;es la memoria principal. La memoria principal es un recurso muy importante que se ha de gestionar cuidadosamente para agilizar la ejecuci&oacute;n de los procesos. Ante un fallo de energ&iacute;a el&eacute;ctrica, como la memoria principal es vol&aacute;til se pierde su contenido .</p>
        <p align="justify">La memoria principal se optimiza para&nbsp;asignar espacio a los diferentes programas a ejecutar. Entre los diferentes procesos a ejecutar se comparte la memoria principal. El espacio de memoria asignado se protege para que no se use estando concedido.</p>
      <p align="justify">El sistema operativo es el responsable de gestionar la memoria principal conociendo qu&eacute; espacios de la memoria est&aacute; siendo utilizada y por qu&eacute; procesos, decidiendo qu&eacute; procesos se cargar&aacute;n en memoria cuando haya espacio disponible, asignando y reclamando espacio de memoria cuando sea necesario, administrar el intercambio entre la memoria principal y la memoria virtual (espacio en el disco usado para los procesos cuando la memoria principal no es suficiente).</p></td>
    </tr>
    <tr>
      <td><h3 align="justify"><a name="Gestion_alm" id="Gestion_alm"></a>Gesti&oacute;n del almacenamiento secundario</h3>
        <p align="justify">La memoria principal no es suficiente para almacenar los programas y los datos, adem&aacute;s de ser vol&aacute;til porque los datos se pierden ante un fallo de la energ&iacute;a el&eacute;ctrica. Por tal motivo es necesario un&nbsp;sistema de almacenamiento&nbsp;secundario tambi&eacute;n denominado&nbsp;memoria virtual.</p>
        <p align="justify">El sistema de almacenamiento secundario representa otro de&nbsp;los componentes de un sistema operativo&nbsp;y no es m&aacute;s que un espacio reservado en&nbsp;los discos&nbsp;con el objetivo de almacenar los programas que no necesitan estar en la memoria principal y para el intercambio de los programas desde y hacia la memoria principal.</p>
      <p align="justify">El sistema operativo se encarga de planificar los discos, gestionar el espacio libre, asignar el almacenamiento y verificar que los datos se guarden en orden.</p></td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td><h3 align="justify"><a name="Sist_entr_sl" id="Sist_entr_sl"></a>Sistema de entrada/salida</h3>
        <p align="justify">El sistema de entrada/salida, otro de&nbsp;los componentes del sistema operativo, representa el&nbsp;intercambio de informaci&oacute;n entre el procesador y los dispositivos perif&eacute;ricos&nbsp;(teclado, mouse, pantalla, impresora y otros). Los dispositivos perif&eacute;ricos solicitan recursos del sistema por medio de interrupciones.</p>
        <p align="justify">El sistema de E/S est&aacute; compuesto por un sistema de almacenamiento temporal (cach&eacute;), una interfaz de controladores de dispositivos y otra interfaz para dispositivos espec&iacute;ficos.</p>
      <p align="justify">El sistema operativo gestiona el almacenamiento temporal de entrada/salida y las interrupciones de los dispositivos de entrada/salida.</p></td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td><h3 align="justify">&nbsp;</h3>      </td>
      <td><h3 align="justify"><a name="Sist_arch" id="Sist_arch"></a>Sistema de archivos</h3>
        <p align="justify">Los archivos representan un&nbsp;conjunto de informaci&oacute;n almacenada en los discos de una PC. Dicha informaci&oacute;n se almacena de forma relacionada y organizada. Los archivos almacenan tanto los programas como los datos.</p>
        <p align="justify">El sistema de archivos forma parte de&nbsp;los componentes de un sistema operativo&nbsp;y son la forma en que se organiza la informaci&oacute;n. Los sistemas de archivos m&aacute;s comunes son FAT,&nbsp;FAT32, ext3, NTFS, XFS.</p>
      <p align="justify">El sistema operativo es responsable de construir y eliminar archivos y directorios, manipular archivos y directorios, establecer la correspondencia entre archivos y unidades de almacenamiento, realizar copias de seguridad de archivos.</p></td>
    </tr>
    <tr>
      <td><h3 align="justify">&nbsp;</h3>      </td>
      <td><h3 align="justify"><a name="Sist_prot" id="Sist_prot"></a>Sistemas de protecci&oacute;n</h3>
        <p align="justify">En un sistema operativo varios usuarios pueden ejecutar simult&aacute;neamente sus programas, varios procesos se pueden ejecutar simult&aacute;neamente, varios programas se pueden ejecutar al mismo tiempo, varios procesos se pueden intercalar para su ejecuci&oacute;n simulando una ejecuci&oacute;n simult&aacute;nea.</p>
        <p align="justify">Normalmente estos sistemas operativos utilizan m&eacute;todos de protecci&oacute;n de datos, por ejemplo para que un programa no pueda usar o cambiar los datos de otro usuario. El sistema de protecci&oacute;n es uno de&nbsp;los componentes del sistema operativo&nbsp;que proporciona el mecanismo que&nbsp;controla el acceso de los programas o los usuarios a los recursos del sistema.</p>
      <p align="justify">El sistema operativo se encarga de distinguir entre uso autorizado y no autorizado, especificar los controles de seguridad a realizar y forzar el uso de los mecanismos de protecci&oacute;n.</p></td>
    </tr>
    <tr>
      <td><h3 align="justify"><a name="Sist_comun" id="Sist_comun"></a>Sistema de comunicaciones</h3>
        <p align="justify">El sistema de comunicaciones es uno de&nbsp;los componentes de un sistema operativo&nbsp;que permite el&nbsp;intercambio de informaci&oacute;n entre procesos y programas&nbsp;que se ejecutan localmente con procesos y programas que se ejecutan de forma remota.</p>
        <p align="justify">Las tareas de env&iacute;o y recepci&oacute;n de informaci&oacute;n las ejecuta el sistema de comunicaciones a trav&eacute;s de las interfaces de red.</p>
      <p align="justify">El sistema operativo es el responsable de controlar el env&iacute;o y recepci&oacute;n de la informaci&oacute;n, crear y mantener la comunicaci&oacute;n para que las aplicaciones env&iacute;en y reciban informaci&oacute;n, y crear y mantener conexiones virtuales entre aplicaciones locales y aplicaciones remotas.</p></td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td><h3 align="justify"><a name="Prg_sist" id="Prg_sist"></a>Programas del sistema</h3>
        <p align="justify">Los programas del sistema forman parte de&nbsp;los componentes del sistema operativo&nbsp;y son&nbsp;aplicaciones que se instalan&nbsp;con el sistema operativo pero que no forman parte de &eacute;l. Los programas del sistema son &uacute;tiles para el desarrollo y ejecuci&oacute;n de los programas de usuario.</p>
        <p align="justify">Las tareas que realizan los programas del sistema son: manipulaci&oacute;n y modificaci&oacute;n de archivos, informaci&oacute;n del estado del sistema, soporte a lenguajes de programaci&oacute;n y comunicaciones.</p>
      <p align="justify">El sistema operativo es el encargado de gestionar las tareas que realizan los diferentes programas del sistema.</p></td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td><h3 align="justify">&nbsp;</h3>      </td>
      <td><h3 align="justify"><a name="Gest_recur" id="Gest_recur"></a>Gesti&oacute;n de recursos</h3>
        <p align="justify">Una PC est&aacute; formada por&nbsp;el hardware y el software. El hardware se relaciona con&nbsp;los componentes&nbsp;f&iacute;sicos y el software con los programas y el sistema operativo.</p>
        <p align="justify">Para que una&nbsp;PC&nbsp;pueda realizar las tareas solicitadas por el usuario requiere de la asignaci&oacute;n de recursos para cada una de esas tareas. El sistema operativo administra los recursos que se deben asignar a los programas en ejecuci&oacute;n.</p>
      <p align="justify">El sistema operativo administra la unidad central de procesamiento, los dispositivos de entrada y salida, la memoria principal o memoria RAM, los discos o memoria virtual, los procesos o programas en ejecuci&oacute;n y en general todos los recursos del sistema.</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="3"><div align="center" class="bold"><a name="caracteristicas" id="caracteristicas"></a>Caracteristicas de un Sistema Operativo </div></td>
    </tr>
    <tr>
      <td width="196" height="71" rowspan="2"><p>&nbsp;</p>
          <p>&nbsp;</p></td>
      <td colspan="2"><p align="justify">Un sistema operativo tiene las siguientes caracter&iacute;sticas b&aacute;sicas:</p>
      </td>
    </tr>
    <tr>
      <td width="334" height="147"><div align="justify">
          <ul class="p ">
            <li>
              <p>Los sistemas operativos hacen m&aacute;s conveniente el uso del dispositivo electr&oacute;nico.</p>
            </li>
            <li>
              <p>Los SO administran de manera correcta y eficiente los recursos del hardware.</p>
            </li>
            <li>
              <p>Los SO pueden aceptar nuevas funciones sin presentar problemas para efectuarse.</p>
            </li>
            </ul>
      </div></td>
      <td width="270"><ul>
        <li class="p">
          <div align="justify">Debe recibir todas las se&ntilde;ales que recibe del hardware y dispositivos perif&eacute;ricos conectados al mismo.</div>
        </li>
        <li class="p">
          <div align="justify">Puede detectar otros sistemas operativos. </div>
        </li>
        <li class="p">
          <div align="justify">Est&aacute; regulado por un algoritmo.</div>
        </li>
      </ul>
      </td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td width="414"><p align="justify" class="p"><strong>Poseen gesti&oacute;n de trabajo</strong>: Permite planificar de manera eficiente las tareas para que sean manejadas por el sistema del computador.&nbsp;Crea el orden en el cual los programas son procesados y la secuencia en la cual trabajos particulares pueden ser ejecutados. Organiza el trabajo seg&uacute;n:</p>
        <ul>
          <li class="p">Los trabajos que est&aacute;n siendo procesados actualmente.</li>
          <li class="p">Los recursos del sistema que est&aacute;n en uso.</li>
          <li class="p">Los recursos que necesitan los programas que siguen.</li>
          <li class="p">Prioridad del trabajo respecto a otros.</li>
          <li class="p">Respuestas a requerimientos especiales.</li>
      </ul>        </td>
      <td width="386">&nbsp;</td>
    </tr>
    <tr>
      <td height="147"><h3 align="justify">&nbsp;</h3></td>
      <td><span class="p"><strong>Poseen gesti&oacute;n de recursos:</strong> Es otra de las funciones principales de un SO.&nbsp;Si un recurso no est&aacute; disponible, un programa no puede hacer uso de &eacute;l<strong>.</strong>&nbsp;Los SO supervisan la ejecuci&oacute;n de cada uno de lso programas y dispositivos utilizados por el hardware y los organiza en una tabla, de esta forma puede aprobar o denegar el uso de alg&uacute;n programa o dispositivo.</span></td>
    </tr>
    <tr>
      <td height="248"><h3 align="justify">&nbsp;</h3>      </td>
      <td><p class="p"><strong>Controlan operaciones input/output:</strong> El sistema operativo&nbsp;coordina las operaciones input/output y los dispositivos en los que son necesarias<strong>.</strong>&nbsp;Para ello establece un diccionario de programas y los dispositivos que deben emplear para completar sus operaciones input/output. </p>
        <p class="p">Esto es lo que te permite leer informaci&oacute;n en lugares espec&iacute;ficos o imprimir documentos en dispositivos elegidos.</p>
      <p class="p">Para facilitar las tareas input/output, los sistemas operativos&nbsp;cuentan con un set de instrucciones de control que les permiten procesar las instrucciones input/output<strong>.</strong></p></td>
    </tr>
    <tr>
      <td><p class="p"><strong>Son sistemas multi tareas:</strong> Los sistemas modernos&nbsp;permiten ejecutar una gran variedad de tareas a la vez&nbsp;como leer informaci&oacute;n del disco, imprimir documentos, reproducir m&uacute;sica y permitir la escritura de un documento.</p></td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td><h3 align="justify">&nbsp;</h3></td>
      <td class="p"><p><strong>Gestionan la memoria:</strong> En los SO cada proceso&nbsp;cuenta con un espacio de memoria determinado&nbsp;y para que puedan ser llevados a cabo la memoria debe estar libre, todo esto lo gestiona el SO.</p></td>
    </tr>
    <tr>
      <td><p class="p"><strong>Poseen mecanismos asociados:</strong> Al ser sistemas operativos multiusos estos pueden proveer diferentes mecanismos b&aacute;sicos como: </p>
        <ul>
          <li class="p">Autenticaci&oacute;n para comprobar la identidad de cada usuario.</li>
          <li class="p">Protecci&oacute;n contra programas err&oacute;neos que puedan provocar bloqueos o que sean maliciosos y generen da&ntilde;os en las tareas.</li>
          <li class="p">Administraci&oacute;n que limita los recursos a cada usuario</li>
        </ul>        </td>
      <td><h3 align="justify">&nbsp;</h3>      </td>
    </tr>
    <tr>
      <td><h3 align="justify">&nbsp;</h3>      </td>
      <td class="p"><p><strong>N&uacute;cleo:</strong> Es la parte esencial de un SO,&nbsp;proveen un mecanismo para que los diferentes procesos de un ordenador puedan comunicarse entre s&iacute; y a la vez, manejar la RAM del ordenador. </p>
        <p>Poseen drivers o controladores que permiten el uso de discos duros, monitores y otro tipo de hardware.</p></td>
    </tr>
    <tr>
      <td><p class="p"><strong>Permiten conexi&oacute;n:</strong> Permiten la conexi&oacute;n entre el hardware, el software y la interfaz de usuario, en fin, todo lo que necesita un ordenador o dispositivo electr&oacute;nico para ser utilizado.</p></td>
      <td>&nbsp;</td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold">
        <h2 align="center" class="bold"><a name="Sist_basicos" id="Sist_basicos"></a>Sistemas operativos b&aacute;sicos: los m&aacute;s comunes y utilizados</h2>
      </div></td>
    </tr>
    <tr>
      <td width="485" height="269"><p>Dentro de los&nbsp;<strong>distintos tipos de sistemas operativos</strong>, hay varios que podemos considerar&nbsp;<strong>b&aacute;sicos</strong>. Son los m&aacute;s utilizados, tanto para ordenador como para dispositivos m&oacute;viles. Dentro de los primeros est&aacute;n&nbsp;<strong>Windows</strong>, para PC;&nbsp;<strong>Mac OS</strong>, que es el sistema operativo de los ordenadores de Apple; y&nbsp;<strong>Linux</strong>, tambi&eacute;n para PC, que est&aacute; disponible en varias versiones de funcionamiento similar. De estos tres,&nbsp;<strong>el m&aacute;s utilizado y popular es Windows</strong>, de Microsoft, sobre todo por su facilidad de manejo e instalaci&oacute;n. Su actualizaci&oacute;n tambi&eacute;n es muy sencilla, y adem&aacute;s suele venir preinstalado en muchos ordenadores, lo que facilita su difusi&oacute;n.</p>
        <p>Dentro de los sistemas operativos para dispositivos m&oacute;viles, los m&aacute;s utilizados son&nbsp;<strong>iOS</strong>&nbsp;y&nbsp;<strong>Android</strong>. El primero est&aacute; incluido en las tablets y smartphones de Apple, mientras que el segundo lo lleva la inmensa mayor&iacute;a de m&oacute;viles y tablets del resto de fabricantes.</p>        
      </td>
      <td width="315">&nbsp;</td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold">
          <h2 class="bold"><a name="Tipos" id="Tipos"></a>Tipos de sistemas operativos</h2>
          </div></td>
    </tr>
    <tr>
      <td width="236" height="269"><h3>&nbsp;</h3>        </td>
      <td width="564"><h3><strong><a name="lotes" id="lotes"></a>Sistema operativo por lotes</strong></h3>
        <p>Este tipo de sistema operativo se caracteriza porque&nbsp;se encarga de ejecutar los procesos sin necesidad de que el usuario&nbsp;del sistema&nbsp;tenga que interactuar con el ordenador&nbsp;de manera directa. El sistema cuenta con un operador encargado de agrupar y dividir en varios lotes los trabajos que tienen que realizar, en funci&oacute;n de su similitud.</p>
        <p>Se trata de un sistema que pueden emplear varios usuarios, y que presenta un nivel de inactividad bajo. Se emplea sobre todo para el proceso de tareas de gran envergadura que pueden dividirse en varios lotes. Este tipo de sistemas se utiliza sobre todo&nbsp;en determinados entornos empresariales, en operaciones como la gesti&oacute;n de n&oacute;minas, o la generaci&oacute;n de estados de cuentas en los bancos.</p>
        <h3><strong><a name="multitarea" id="multitarea"></a>Sistemas operativos multitarea o de tiempo compartido</strong></h3>
        <p> Esta clase de sistema operativo&nbsp;permite la ejecuci&oacute;n de distintas tareas al mismo tiempo, tanto de un solo usuario como de varios. As&iacute;, cuando el sistema termina de ejecutar una tarea, ya sea de un usuario o de varias, contin&uacute;a con la siguiente que tiene en espera. Un ejemplo de este tipo de sistema operativo es&nbsp;Unix.</p>
        <h3><strong><a name="real" id="real"></a>Sistemas operativos en tiempo real</strong></h3>
        <p>Un sistema operativo en tiempo real es el que&nbsp;deja un espacio de tiempo muy peque&ntilde;o para el proceso de entradas, as&iacute; como&nbsp;para darles respuesta. Se usan en sistemas que tienen unos requisitos muy elevados de tiempo de respuesta, y muy estrictos. Entre otros escenarios, se emplean en robots, sistemas encargados del control del tr&aacute;fico a&eacute;reo o sistemas industriales. Tambi&eacute;n, en determinados tipos de experimentos cient&iacute;ficos.</p>
        <h3><strong><a name="distribuidos" id="distribuidos"></a>Sistemas distribuidos</strong></h3>
        <p>Estos&nbsp;trabajan con varios dispositivos a la vez, cada uno con su procesador, con el fin de&nbsp;ofrecer a sus usuarios una potencia elevada de computaci&oacute;n. Tambi&eacute;n la posibilidad de realizar c&aacute;lculos y procesos de una manera muy veloz. Son sistemas que se han desarrollado hace relativamente poco tiempo, y permiten a sus usuarios el acceso a ficheros y programas que no est&aacute;n instalados o almacenados en el equipo que utilizan en un momento dado, pero que est&aacute;n en otros equipos que est&eacute;n conectados al mismo sistema operativo que tiene el que est&aacute;n empleando. Esto quiere decir que cuenta con&nbsp;funciones de acceso remoto dentro de una misma red.</p>
        <h3><strong><a name="red" id="red"></a>Sistemas operativos de red</strong></h3>
        <p>Son los que&nbsp;se ejecutan y administran en un servidor. A trav&eacute;s de estos sistemas operativos se pueden gestionar distintas funciones de red, as&iacute; como usuarios, grupos o datos. Tambi&eacute;n, la seguridad de todos los equipos conectados a la red local o privada que tienen conexi&oacute;n con este servidor.</p>
        <h3><strong><a name="moviles" id="moviles"></a>Sistemas operativos m&oacute;viles</strong></h3>
        <p> Son los que se han&nbsp;creado y desarrollado para dispositivos m&oacute;viles, fundamentalmente m&oacute;viles y tablets, pero tambi&eacute;n relojes inteligentes. Los m&aacute;s conocidos son Android y iOS, como hemos visto, pero tambi&eacute;n hay otros como&nbsp;webOS&nbsp;y&nbsp;watchOS, para relojes inteligentes.</p>
      <p>Estas son las funciones y caracter&iacute;sticas m&aacute;s destacadas de los sistemas operativos, sus principales tipos y los m&aacute;s conocidos de cada tipo.&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  </div>
</body>
</html>
