<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<style type="text/css">
<!--
body {
	background-color: #E8DB7D;
}
-->
</style>
<link href="../CSS_Cuerpo.css" rel="stylesheet" type="text/css" />

<style type="text/css">
<!--
.Estilo1 {font-weight: bold}
-->
</style>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>


</head>

<body>
<div align="center">
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td colspan="2"><div align="center" class="bold">Evolucion de las computadoras</div></td>
    </tr>
    <tr>
      <td width="485" height="116"><p>El Electronic Numerical Integrator and Computer, m&aacute;s  conocido como ENIAC, se ha considerado a menudo la primera computadora de  prop&oacute;sito general, aunque este t&iacute;tulo pertenece en realidad a la computadora alemana  Z3. Era totalmente digital, es decir, ejecutaba sus procesos y operaciones  mediante instrucciones en lenguaje m&aacute;quina, a diferencia de otras m&aacute;quinas  contempor&aacute;neas de procesos anal&oacute;gicos. Presentada al p&uacute;blico el 15 de febrero  de 1946, John W. Mauchly y John Presper Eckert de la Universidad de Pensilvania  (EE. UU.) iniciaron su desarrollo en 1943. Esta enorme m&aacute;quina med&iacute;a m&aacute;s de 30  metros de largo y pesaba 32 toneladas, estaba compuesta por 17 468 v&aacute;lvulas. El  calor de las v&aacute;lvulas elevaba la temperatura de la sala donde se hallaba  instalada hasta los 50 &deg;C. y para que llevase a cabo las operaciones para las  que se hab&iacute;a dise&ntilde;ado. Cuando la ENIAC se termin&oacute; en 1946, la II Guerra Mundial  ya hab&iacute;a terminado. El fin de la contienda hizo que los esfuerzos hasta  entonces dedicados principalmente a objetivos militares, se destinaran tambi&eacute;n  a otro tipo de investigaci&oacute;n cient&iacute;fica m&aacute;s relacionada con las necesidades de  la empresa privada. Los esfuerzos m&uacute;ltiples dieron resultados en 1945 Mauchly y  Eckert comenzaron a trabajar en una sucesora de la ENIAC, el EDVAC (Electronic  Discrete Variable Automatic Computer) y Aiken inici&oacute; el dise&ntilde;o de la Mark II.  En 1951, el que est&aacute; considerado como la primera computadora que se llam&oacute; Saly  fue ampliamente comercializada, la UNIVAC I, comenz&oacute; a funcionar con &eacute;xito. En  1952 la computadora UNIVAC se utiliz&oacute; para realizar el recuento de votos en las  elecciones presidenciales de EE. UU. El resultado victoria (EIsenhower sobre  Adlai Stevenson) se conoci&oacute; 50 minutos despu&eacute;s de que se cerraran los colegios  electorales.</p>
      </td>
      <td width="315">&nbsp;</td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td height="26"><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify" class="bold">Indice</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td height="150" align="left" valign="top"><p><a href="#Evolucion">1. Evolucion de las computadoras. </a></p>
        <p> <a href="#Primera">--1.1 Primera generaci&oacute;n  (1946-1955)</a><br />
          <a href="#Segunda">--1.2 Segunda Generaci&oacute;n (1950-1962)</a><br />
           <a href="#Tercera">--1.3 Tercera generaci&oacute;n de  computadoras (1964-1971)</a><br />
           <a href="#Cuarta">--1.4 Cuarta generaci&oacute;n  (1971-1981)</a><br />
           <a href="#Quinta">--1.5 Quinta generaci&oacute;n  (1981-1989)</a><br />
           <a href="#Sexta">--1.6 Sexta generaci&oacute;n (1990-1998)</a><br />
           <a href="#Septima">--1.7 S&eacute;ptima generaci&oacute;n  (1999-actualidad)</a></p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><p align="justify">&nbsp;</p></td>
    </tr>
  </table>
  <table width="800" border="0" cellspacing="0" cellpadding="0">
    <tr>
      <td><div align="center" class="bold"><a name="Evolucion" id="Evolucion"></a>Evolucion de las computadoras</div></td>
    </tr>
    <tr>
      <td height="116"><p><strong><a name="Primera" id="Primera"></a>Primera generaci&oacute;n  (1946-1955)</strong><br />
        Estaban construidas con electr&oacute;nica de v&aacute;lvulas de vac&iacute;o. Se  programaban en lenguaje de la m&aacute;quina. Un programa es un conjunto de  instrucciones para que la m&aacute;quina efect&uacute;e alguna tarea, y el lenguaje m&aacute;s  simple en el que puede especificarse un programa se llama lenguaje de m&aacute;quina  (porque el programa debe escribirse mediante alg&uacute;n conjunto de c&oacute;digos  binarios). La primera generaci&oacute;n de computadoras y sus antecesores, se  describen en la siguiente lista de los principales modelos de que const&oacute;:<br />
        1946 ENIAC. Considerada a menudo como la primera computadora  digital electr&oacute;nica en la historia. No fue un modelo de producci&oacute;n, sino una  m&aacute;quina experimental. Tampoco era programable en el sentido actual. Se trataba  de un enorme aparato que ocupaba todo un s&oacute;tano en la universidad. Construida  con 18 000 tubos de vac&iacute;o, consum&iacute;a varios kW de potencia el&eacute;ctrica y pesaba 27  toneladas. Era capaz de efectuar cinco mil sumas por segundo. Fue hecha por un  equipo de ingenieros y cient&iacute;ficos encabezados por los doctores John W. Mauchly  y J. Presper Eckert1&#8203; en la universidad de Pensilvania, en los Estados Unidos.<br />
        1949 EDVAC. Segunda computadora programable. Tambi&eacute;n fue un  prototipo de laboratorio, pero ya inclu&iacute;a en su dise&ntilde;o las ideas centrales que  conforman las computadoras actuales.</p>
        <p>1951 UNIVAC I. Primera computadora comercial. Los doctores  Mauchly y Eckert fundaron la compa&ntilde;&iacute;a Universal Computer (Univac), y su primer  producto fue esta m&aacute;quina. El primer cliente fue la Oficina del Censo de  Estados Unidos.<br />
          1953 IBM 701. Para introducir los datos, estos equipos  empleaban tarjetas perforadas, que hab&iacute;an sido inventadas en los a&ntilde;os de la  revoluci&oacute;n industrial (finales del siglo xviii) por el franc&eacute;s Joseph Marie  Jacquard y perfeccionadas por el estadounidense Herman Hollerith en 1890. La  IBM 701 fue la primera de una larga serie de computadoras de esta compa&ntilde;&iacute;a, que  luego se convertir&iacute;a en la n&uacute;mero uno, por su volumen de ventas.<br />
          - IBM continu&oacute; con otros modelos, que incorporaban un  mecanismo de almacenamiento masivo llamado tambor magn&eacute;tico, que con los a&ntilde;os  evolucionar&iacute;a y se convertir&iacute;a en el disco magn&eacute;tico.<br />
          - Zuse Z22. La primera computadora de Konrad Zuse  aprovechando los tubos del vac&iacute;o. El procesador de la UNIVAC pesaba 30  toneladas y requer&iacute;a el espacio completo de un sal&oacute;n de 20 por 40 pies.</p>
        <p><strong><a name="Segunda" id="Segunda"></a>Segunda Generaci&oacute;n (1950-1962)</strong><br />
          La segunda generaci&oacute;n de las computadoras reemplaz&oacute; las  v&aacute;lvulas de vac&iacute;o por los transistores. Con esto, las computadoras de la  segunda generaci&oacute;n son m&aacute;s peque&ntilde;as y consumen menos electricidad que las de la  anterior. La forma de comunicaci&oacute;n con estas nuevas computadoras es mediante  lenguajes m&aacute;s avanzados que el lenguaje de m&aacute;quina, los cuales reciben el  nombre de &ldquo;lenguajes de alto nivel&quot; o &quot;lenguajes de  programaci&oacute;n&quot;.<br />
          Las caracter&iacute;sticas m&aacute;s relevantes de las computadoras de la  segunda generaci&oacute;n eran:</p>
        <ul>
          <li class="p">Se programaban con lenguajes de alto nivel.</li>
        </ul>
        <p>1951: Maurice Wilkes inventa la microprogramaci&oacute;n, que  simplifica mucho el desarrollo de las CPU pero esta microprogramaci&oacute;n tambi&eacute;n  fue cambiada m&aacute;s tarde por el computador alem&aacute;n Bastian Shuantiger.<br />
          1956: IBM vendi&oacute; por un valor de 1 230 000 d&oacute;lares su primer  sistema de disco magn&eacute;tico, el RAMAC (Random Access Method of Accounting and  Control). Usaba 50 discos de metal de 61 cm, con 100 pistas por lado. Pod&iacute;a  guardar 5 megabytes de datos, con un coste de 10 000 USD por megabyte. El  primer lenguaje de programaci&oacute;n de prop&oacute;sito general de alto-nivel, FORTRAN,  tambi&eacute;n estaba desarroll&aacute;ndose en la empresa IBM alrededor de este tiempo. (El  dise&ntilde;o de lenguaje de alto-nivel Plankalk&uuml;l de 1945 de Konrad Zuse no se  implement&oacute; en ese momento).<br />
          1959: IBM envi&oacute; el mainframe IBM 1401 basado en  transistores, que utilizaba tarjetas perforadas. Demostr&oacute; ser una computadora  de prop&oacute;sito general y se vendieron 12 000 unidades, haci&eacute;ndola la m&aacute;quina m&aacute;s  exitosa en la historia de la computaci&oacute;n. Ten&iacute;a una memoria de n&uacute;cleo magn&eacute;tico  de 4000 caracteres (despu&eacute;s se extendi&oacute; a 16 000 caracteres). Muchos aspectos  de sus dise&ntilde;os estaban basados en el deseo de reemplazar el uso de tarjetas  perforadas, que eran muy usadas desde los a&ntilde;os 1920 hasta principios de la  d&eacute;cada de 1970.<br />
          1960:la empresa IBM lanz&oacute; el mainframe IBM 1620 basada en  transistores, originalmente con solo una cinta de papel perforado, pero pronto  se actualiz&oacute; a tarjetas perforadas. Prob&oacute; ser una computadora cient&iacute;fica  popular y se vendieron aproximadamente 2000 unidades. Utilizaba una memoria de  n&uacute;cleo magn&eacute;tico de m&aacute;s de 60 000 d&iacute;gitos decimales.<br />
          1962: Se desarrolla el primer juego de ordenador, llamado  Spacewar!. DEC lanz&oacute; el PDP-1, su primera m&aacute;quina orientada al uso por personal  t&eacute;cnico en laboratorios y para la investigaci&oacute;n.</p>
        <p><strong><a name="Tercera" id="Tercera"></a>Tercera generaci&oacute;n de  computadoras (1964-1971)</strong><br />
          La tercera generaci&oacute;n de computadoras emergi&oacute; con el  desarrollo de circuitos integrados (pastillas de silicio) en las que se colocan  miles de componentes electr&oacute;nicos en una integraci&oacute;n en miniatura. A finales de  los a&ntilde;os 1950 se produjo la invenci&oacute;n del circuito integrado o chip. Despu&eacute;s  llev&oacute; a la invenci&oacute;n del microprocesador, en la formaci&oacute;n de 1960,  investigadores como en el formaban un c&oacute;digo, otra forma de codificar o  programar.<br />
          A partir de esta fecha, empezaron a empaquetarse varios  transistores diminutos y otros componentes electr&oacute;nicos en un solo chip o  encapsulado, que conten&iacute;a en su interior un circuito completo: un amplificador,  un oscilador, o una puerta l&oacute;gica. Naturalmente, con estos chips (circuitos  integrados) era mucho m&aacute;s f&aacute;cil montar aparatos complicados: receptores de radio  o televisi&oacute;n y computadoras.<br />
          En 1964, anunci&oacute; el primer grupo de m&aacute;quinas construidas con  circuitos integrados, que recibi&oacute; el nombre de &quot;serie&quot;.<br />
          1964: la empresa IBM anunci&oacute; la serie IBM S/360, que fue la  primera familia de computadoras que pod&iacute;a correr el mismo software en  diferentes combinaciones de velocidad, capacidad y precio. Tambi&eacute;n abri&oacute; el uso  comercial de microprogramas, y un juego de instrucciones extendidas para  procesar muchos tipos de datos, no solo aritm&eacute;tica. Adem&aacute;s, se unific&oacute; la l&iacute;nea  de producto de IBM, que previamente a este tiempo ten&iacute;a dos l&iacute;neas separadas,  una l&iacute;nea de productos &ldquo;comerciales&rdquo; y una l&iacute;nea &ldquo;cient&iacute;fica&rdquo;. El software  proporcionado con el System/350 tambi&eacute;n incluy&oacute; mayores avances, incluyendo  multiprogramaci&oacute;n disponible comercialmente, nuevos lenguajes de programaci&oacute;n,  e independencia de programas de dispositivos de entrada/salida. M&aacute;s de 14 000  unidades del System/360 hab&iacute;an sido entregadas en 1968. Se considera el 360 el  punto de partida para la tercera generaci&oacute;n de computadoras y sonic.<br />
          Estas computadoras de tercera generaci&oacute;n sustituyeron  totalmente a los de segunda, introduciendo una nueva forma de programar que a&uacute;n  se mantiene en las grandes computadoras actuales.<br />
          Las caracter&iacute;sticas de la tercera generaci&oacute;n son:</p>
        <ul>
          <li class="p">Menor consumo de energ&iacute;a el&eacute;ctrica.</li>
          <li class="p">Aumento de fiabilidad y flexibilidad.</li>
          <li class="p">Teleproceso.</li>
          <li class="p">Multiprogramaci&oacute;n.</li>
          <li class="p">Renovaci&oacute;n de perif&eacute;ricos.</li>
          <li class="p">Minicomputadoras, no tan costosas y con gran  capacidad de procesamiento. Algunas de las m&aacute;s populares fueron la PDP-8 y la  PDP-11.</li>
          <li class="p">Se pudo calcular &pi; (n&uacute;mero Pi) con 500 mil  decimales.</li>
        </ul>
        <p><strong><a name="Cuarta" id="Cuarta"></a>Cuarta generaci&oacute;n  (1971-1981)</strong><br />
          Fase caracterizada por la integraci&oacute;n sobre los componentes  electr&oacute;nicos, lo que propici&oacute; la aparici&oacute;n del microprocesador un &uacute;nico  circuito integrado en el que se re&uacute;nen los elementos b&aacute;sicos de la m&aacute;quina. Se  desarroll&oacute; el &quot;chip&quot;.<br />
          Se colocan m&aacute;s circuitos dentro de un &quot;chip&quot;. Cada  &quot;chip&quot; puede hacer diferentes tareas. Un &quot;chip&quot; sencillo  actualmente contiene la unidad de control y la unidad de aritm&eacute;tica/l&oacute;gica. El  tercer componente, la memoria primaria, es operado por otros &quot;chips&quot;.  Se reemplaza la memoria de n&uacute;cleos magn&eacute;ticos por la memoria de  &quot;chips&quot; de silicio. Se desarrollan las microcomputadoras, es decir,  computadoras personales o PC. Se desarrollan las supercomputadoras. La  denominada Cuarta Generaci&oacute;n (1971 a 1983) es el producto de la micro miniaturizaci&oacute;n  de los circuitos electr&oacute;nicos. El tama&ntilde;o reducido del microprocesador de chips  hizo posible la creaci&oacute;n de las computadoras personales (PC). Hoy en d&iacute;a las  tecnolog&iacute;as LSI (Integraci&oacute;n a gran escala) y VLSI (Integraci&oacute;n a muy gran  escala) permiten que cientos de miles de componentes electr&oacute;nicos se almacenen  en un chip. Usando VLSI, un fabricante puede hacer que una computadora peque&ntilde;a  rivalice con una computadora de la primera generaci&oacute;n que ocupaba un cuarto  completo. Hicieron su gran debut las microcomputadoras.<br />
          Hizo que sea una computadora ideal para uso &ldquo;personal&rdquo;, de  ah&iacute; que el t&eacute;rmino &ldquo;PC&rdquo; se estandarizara y los clones que sacaron  posteriormente otras empresas fueron llamados &ldquo;PC y compatibles&rdquo;, usando  procesadores del mismo tipo que las IBM , pero a un costo menor y pudiendo  ejecutar el mismo tipo de programas. Existen otros tipos de microcomputadoras,  como la Macintosh, que no son compatibles con la IBM, pero que en muchos de los  casos se les llaman tambi&eacute;n &ldquo;PC&rdquo;, por ser de uso personal. El primer  microprocesador fue el Intel 4004, producido en 1971. Se desarroll&oacute;  originalmente para una calculadora, y resultaba revolucionario para su &eacute;poca.  Conten&iacute;a 2300 transistores en un microprocesador de 4 bits que s&oacute;lo pod&iacute;a  realizar 60 000 operaciones por segundo.</p>
        <p><strong><a name="Quinta" id="Quinta"></a>Quinta generaci&oacute;n  (1981-1989)</strong><br />
          La quinta generaci&oacute;n , tambi&eacute;n conocida por sus siglas en  ingl&eacute;s, es un proyecto hecho en Jap&oacute;n que comenz&oacute; en 1981. Su objetivo era el  desarrollo de una nueva clase de computadoras que utilizar&iacute;an t&eacute;cnicas y tecnolog&iacute;as  de inteligencia artificial tanto en el plano del hardware como del software.  Usando el lenguaje ser&iacute;a capaces de resolver problemas complejos, como la  traducci&oacute;n autom&aacute;tica de una lengua natural a otra (del japon&eacute;s al ingl&eacute;s, por  ejemplo). Como unidad de medida del rendimiento y prestaciones de estas  computadoras se empleaba la cantidad capaz de realizar durante la ejecuci&oacute;n de  las distintas tareas programadas. Para su desarrollo se emplearon diferentes  tipos de arquitecturas.</p>
        <p><strong><a name="Sexta" id="Sexta"></a>Sexta generaci&oacute;n (1990-1998)</strong><br />
          Esta generaci&oacute;n abarca desde 1990 hasta 1998, en esos  tiempos crearon una computadora llamada NeXTstation que servia para jugar,  estudiar y lo m&aacute;s importante, trabajar. Sali&oacute; a la venta, para computaci&oacute;n  &quot;interpersonal&quot;, como lo describi&oacute; Steve Jobs, su creador. El  NeXTstation se pretend&iacute;a que fuera un computador para los a&ntilde;os 1990, y fue una  m&aacute;s barata versi&oacute;n que el previo NeXT Computer.<br />
          En mayo de 1998 en el que Steve Jobs se present&oacute; ante  periodistas, accionistas y consumidores con la intenci&oacute;n de cambiar el mundo  con su nueva computadora, el primer iMac de apple.<br />
          La primera iMac consigui&oacute; romper con la monoton&iacute;a de los PCs  de Microsoft y hasta de la propia Macintosh, con aspecto compacto y color  beige. La imagen de la nueva m&aacute;quina de Apple ofrec&iacute;a un dise&ntilde;o en forma de  huevo, con una carcasa transparente que dejaba ver sus entra&ntilde;as y se ofrec&iacute;a en  diferentes y divertidos colores. Tambi&eacute;n ten&iacute;a un asa en la parte superior que  permit&iacute;a una mejor movilidad.<br />
        Adem&aacute;s, el iMac fue el primer computador todo en uno, donde  hardware y software se encontraban en un mismo sitio. Lo &uacute;nico que se conectaba  al ordenador eran el teclado y el rat&oacute;n, sin necesidad de torres.</p>
        <p><strong><a name="Septima" id="Septima"></a>S&eacute;ptima generaci&oacute;n  (1999-actualidad)</strong><br />
          La s&eacute;ptima generaci&oacute;n comienza en el a&ntilde;o 1999 donde  popularizan las pantallas plana LCD 2 y hacen a un lado a los rayos cat&oacute;dicos,  en donde se han dejado los DVD y los formatos de disco duro &oacute;ptico.<br />
          La nueva generaci&oacute;n de almacenamiento de datos de alta  densidad con una capacidad de almacenamiento que llega a las 50 GB, aunque se  ha confirmado que esta lista puede recibir 16 capas de 400 GB.<br />
      Son m&aacute;s peque&ntilde;as y vers&aacute;tiles, as&iacute; como las pantallas  t&aacute;ctiles, los libros electr&oacute;nicos, tablets, m&oacute;viles de &uacute;ltima generaci&oacute;n e  infinidad de dispositivos electr&oacute;nicos, como los reproductores de m&uacute;sica y  v&iacute;deo en mp3 y mp4 u otros formatos, las c&aacute;maras de fotos digitales, los discos  duros externos y las memorias flash o usb, incluso las pantallas planas de alta  resoluci&oacute;n.</p></td>
    </tr>
  </table>  
  <p>&nbsp;</p>
</div>
</body>
</html>
